01  WS-DATA-AREA. 
    05  WS-NUMERIC-FIELD PIC 9(5) VALUE 0. 
    05  WS-ALPHANUMERIC-FIELD PIC X(10). 
    05 WS-NUMERIC-FIELD2 PIC 9(5). 

PROCEDURE DIVISION. 
    ADD 1 TO WS-NUMERIC-FIELD. 
    MOVE '12345' TO WS-ALPHANUMERIC-FIELD. 
    MOVE WS-ALPHANUMERIC-FIELD TO WS-NUMERIC-FIELD2. 
    DISPLAY WS-NUMERIC-FIELD WS-ALPHANUMERIC-FIELD WS-NUMERIC-FIELD2. 
    STOP RUN.